app/views/articles/show.html.erb

INSERT INTO "articles" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "<p>will we get there????</p>\r\n"], ["created_at", "2016-03-08 16:01:53.601352"], ["updated_at", "2016-03-08 16:01:53.601352"]]
---
    <ul>
      <li><%= link_to "Version #{@article.versions.index(version) + 1 }", article_version_path(@article, version) %> Created on <%= version.created_at.to_date %> By <%= version.editor.username %></li>