app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 13]]
---
  def edit
    if logged_in?
      @article = Article.find(params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", nil]]
---
  def new
    if logged_in?
      @category = Category.find(params[:category_id])

INSERT INTO "articles" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "<p>will we get there????</p>\r\n"], ["created_at", "2016-03-08 16:01:53.601352"], ["updated_at", "2016-03-08 16:01:53.601352"]]
---
  def create
    if logged_in?
      @category = Category.find(params[:category_id])
      @article = current_user.articles.new(article_params)
      @category.articles << @article