app/controllers/categories_controller.rb

  def index
    @featured_article = Article.find_featured
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def show
    @categories = Category.all
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]